apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
#if MYNEWT_VAL(BLE_LL_DTM_EXTENSIONS)
int
ble_phy_dtm_carrier(uint8_t rf_channel)
{
    /* based on Nordic DTM sample */
    ble_phy_disable();
    ble_phy_enable_dtm();
    ble_phy_mode_apply(BLE_PHY_MODE_1M);
    nrf_radio_shorts_enable(NRF_RADIO, NRF_RADIO_SHORT_READY_START_MASK);
    NRF_RADIO->FREQUENCY = g_ble_phy_chan_freq[rf_channel];
    nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_TXEN);

    return 0;
}
#endif
#endif

void
ble_phy_rfclk_enable(void)
{
#if MYNEWT || defined(RIOT_VERSION)
#ifdef NRF52_SERIES
    nrf52_clock_hfxo_request();
#endif
#ifdef NRF53_SERIES
    nrf5340_net_clock_hfxo_request();
#endif
#else
    nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_HFCLKSTART);
#endif
}

void
ble_phy_rfclk_disable(void)
{
#if MYNEWT || defined(RIOT_VERSION)
#ifdef NRF52_SERIES
    nrf52_clock_hfxo_release();
#endif
#ifdef NRF53_SERIES
    nrf5340_net_clock_hfxo_release();
#endif
#else
    nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_HFCLKSTOP);
#endif
}

void
ble_phy_transition_set(uint8_t trans, uint16_t usecs)
{
    uint8_t transition;
    uint8_t anchor;

    if (trans == BLE_PHY_TRANSITION_TO_TX_ISO_SUBEVENT ||
        trans == BLE_PHY_TRANSITION_TO_RX_ISO_SUBEVENT) {
        anchor = PHY_TRANS_ANCHOR_START;
    } else {
        anchor = PHY_TRANS_ANCHOR_END;
    }

    if (trans == BLE_PHY_TRANSITION_TO_RX ||
        trans == BLE_PHY_TRANSITION_TO_RX_ISO_SUBEVENT) {
        transition = PHY_TRANS_TO_RX;
    } else if (trans == BLE_PHY_TRANSITION_TO_TX ||
               trans == BLE_PHY_TRANSITION_TO_TX_ISO_SUBEVENT) {
        transition = PHY_TRANS_TO_TX;
    } else {
        transition = PHY_TRANS_NONE;
    }

    g_ble_phy_data.phy_transition = transition;
    g_ble_phy_data.tifs_anchor = anchor;
    g_ble_phy_data.tifs_usecs = usecs ? usecs : BLE_LL_IFS;
}

void
ble_phy_wfr_set(uint16_t usecs)
{
    g_ble_phy_data.wfr_usecs = usecs;
}
